IDEA Open Model
TypeOfCombiSIA Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Type of combination
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum TypeOfCombiSIA
Public Enumeration TypeOfCombiSIA
Members
Member name | Value | Description
ULS | 0 |  combination
Accidental | 2 |  accidental combination 1
SLS_Char | 5 |  characteristic combination
SLS_Freq | 6 |  frequent combination
SLS_Quasi | 7 |  quasi combination
Fatigue | 8 |  Fatigue combination
See Also
Reference
IdeaRS.OpenModel.Loading Namespace